# Используем официальный образ Python.
# python:3.10-slim - хороший баланс между размером и функциональностью.
FROM python:3.10-slim

# Устанавливаем рабочую директорию внутри контейнера.
WORKDIR /app

# Копируем файл с зависимостями в контейнер.
COPY requirements.txt .

# Устанавливаем зависимости.
# --no-cache-dir уменьшает размер итогового образа.
RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь остальной код проекта в контейнер.
COPY . .

# Команда, которая будет выполняться при запуске контейнера.
# Мы запускаем Uvicorn сервер.
# --host 0.0.0.0 - ОБЯЗАТЕЛЬНО, чтобы сервер был доступен извне контейнера.
# --port 8000 - порт, который будет "слушать" наш сервер внутри контейнера.
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]